In [145]:
import pandas as pd
import numpy as np

# Преобразование файла с курсом доллара

### Чтобы работало нужно установить openpyxl

pip install openpyxl

In [129]:
df = pd.read_excel('RC_F04_09_2018_T04_11_2022.xlsx')

C:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [133]:
df.head()

   nominal       data     curs         cdx
0        1 2022-11-04  62.0955  Доллар США
1        1 2022-11-03  61.6175  Доллар США
2        1 2022-11-02  61.4275  Доллар США
3        1 2022-11-01  61.6229  Доллар США
4        1 2022-10-29  61.5343  Доллар США

### Получаем из даты год, месяц и день для группировки

In [134]:
df['month'] = df['data'].dt.month

In [135]:
df['day'] = df['data'].dt.day

In [136]:
df['year'] = df['data'].dt.year

In [137]:
df.head()

   nominal       data     curs         cdx  month  day  year
0        1 2022-11-04  62.0955  Доллар США     11    4  2022
1        1 2022-11-03  61.6175  Доллар США     11    3  2022
2        1 2022-11-02  61.4275  Доллар США     11    2  2022
3        1 2022-11-01  61.6229  Доллар США     11    1  2022
4        1 2022-10-29  61.5343  Доллар США     10   29  2022

### Группируем по году и месяцу и считаем средний курс за месяц

In [138]:
df_average = df.groupby(['year','month']).mean('curs').iloc[1:].reset_index()

In [139]:
df_average.head()

   year  month  nominal       curs        day
0  2018     10      1.0  65.854527  15.954545
1  2018     11      1.0  66.355681  16.142857
2  2018     12      1.0  67.335314  16.409091
3  2019      1      1.0  66.512544  20.500000
4  2019      2      1.0  65.810525  14.700000

### Изменяем дату и возвращаем в единый формат

In [140]:
df_average['day'] = 1

In [141]:
df_average['date'] = pd.to_datetime(df_average.loc[:, ["year", "month", "day"]].astype(str))

In [142]:
df_average.head()

   year  month  nominal       curs  day       date
0  2018     10      1.0  65.854527    1 2018-10-01
1  2018     11      1.0  66.355681    1 2018-11-01
2  2018     12      1.0  67.335314    1 2018-12-01
3  2019      1      1.0  66.512544    1 2019-01-01
4  2019      2      1.0  65.810525    1 2019-02-01

### Выбираем только нужные столбцы

In [109]:
lst_df = df_average[['curs','nominal','date']]
lst_df.head()

        curs  nominal       date
0  65.854527      1.0 2018-10-01
1  66.355681      1.0 2018-11-01
2  67.335314      1.0 2018-12-01
3  66.512544      1.0 2019-01-01
4  65.810525      1.0 2019-02-01

### Записываем в csv файл

In [143]:
file_name = 'dollar_curs'

In [144]:
lst_df.to_csv(file_name, sep=';')